{
  "personalInfo": {
    "name": {
      "firstName": "Monique",
      "lastName": "Moledo"
    },
    "font": {
      "url": "https://fonts.googleapis.com/css2?family=Poiret+One&display=swap",
      "name": "'Poiret One', cursive;'"
    },
    "jobTitle": "Software Engineer",
    "location": "Ottawa, Canada",
    "contacts": [{
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/moniquemoledo"
      },
      {
        "name": "github",
        "url": "https://github.com/MoniMoledo"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/monimoledo"
      },
      {
        "name": "facebook",
        "url": "https://www.facebook.com/MoniqueMoledo"
      }
    ]
  },
  "education": [{
      "period": {
        "beginDate": "2015",
        "endDate": "2016"
      },
      "school": "California State University East Bay",
      "major": "Computer Science",
      "type": "Non-degree continuing education",
      "place": "Hayward, United States",
      "badge": "https://upload.wikimedia.org/wikipedia/en/thumb/1/1f/CSUEB.svg/1200px-CSUEB.svg.png",
      "url": "https://www.csueastbay.edu"
    },
    {
      "period": {
        "beginDate": "2013",
        "endDate": "2017"
      },
      "school": "Universidade Federal Fluminense",
      "major": "Computer Science",
      "type": "Bachelor degree",
      "place": "Rio de Janeiro, Brazil",
      "badge": "https://seeklogo.com/images/U/UFF-logo-230B4CA639-seeklogo.com.gif",
      "url": "http://www.uff.br"
    }
  ],
  "experiences": [{
      "period": {
        "beginDate": "May 2018",
        "endDate": "current"
      },
      "jobTitle": "Data Engineer",
      "company": "Shopify",
      "location": "Ottawa, Canada",
      "description": "Shopify is an ecommerce platform, that enables entrepreneurs to sell online, on social media, or in person creating their own brand. During this internship, I have been working on the team that builds and manages internal tools for our data teams and data scientists, such as data presentation, discovery, governance and analysis tools. In this team, I have been working on: \n\n-  Learning analytics products and user interaction requirements since we build end-to-end solutions. For that I have been working with mainly Ruby on Rails or Python, using Flask and SQL Alchemy,  web applications. \n\n- Building structured streaming pipelines with Apache Spark, using both Scala and pySpark.\n\n- Analytical columnar databases and distributed query engines such as Presto, Redshift and Hive, extracting, modeling, transforming and querying data to understand, enable and produce the best insights to our teams.\n\n- Monitoring through dashboards and alerts on Splunk, Datadog and custom alerts.",
      "url": "https://www.shopify.ca/",
      "image": "https://logictocreate.com/wp-content/uploads/2019/02/shopify_logo_white.png",
      "color": "#202E78",
      "text": "#F9FAFB"
    },
    {
      "period": {
        "beginDate": "October 2016",
        "endDate": "April 2018"
      },
      "jobTitle": "Software Engineer",
      "company": "Stone",
      "location": "Rio de Janeiro, Brazil",
      "description": "Stone is the biggest independent payments acquirer in Brazil. I was part of the clearing/settlement team, in which we had to process all the transactions, transform its data and successfully communicate it to the different credit card brands. During the 1 year and 6 months I've spent on this team, I had experience with:\n\n- Managing the project of integrating with Elo, a new credit card brand in Brazil. What demanded high understanding and planning of requirements, scalability and good communication dealing with an external company. Adding Elo to Stone's accepted brands increased the volume of transactions done through our payments system in 30%.\n\n- C#, .NET framework services that would process the transactions in batches. Those solutions needed to be highly available, scalable and resilient since they would process all the financial flow of the company.\n\n- Building a service for calculation of the MasterCard interchange rate.\n\n- Changing a monolithic architecture to a microservices one using RabbitMQ for asynchronous messaging.\n\n- Database remodeling and migration on SQL Server and query improvement, since processing time was crucial.\n\n- Agile development methodologies such as Scrum and/or Kanban\n\n- Best practices with logging and monitoring, using Datazen, Kibana and Splunk dashboards and alerts.\n\n- Management and configuration of deployment with GoCD and Docker.",
      "url": "https://www.stone.com.br",
      "image": "https://lh3.googleusercontent.com/vDHzr4DgKl4IyCEjhuqzRQO9vdd-GGOxmcWXdd9N50lbXDDScyQCviPy2yn5-oS9wg",
      "color": "#09AA36",
      "text": "#fff"
    },
    {
      "period": {
        "beginDate": "June 2016",
        "endDate": "September 2016"
      },
      "jobTitle": "Junior Specialist Developer",
      "company": "University of California, Irvine",
      "location": "Irvine, United States",
      "description": "Project: Cloudberry - Interactive Analytics and Visualization System on Large Scale data\n\n- During the summer I worked with Twitter API to collect data about Zika fever, then I built a pipeline on a Scala service for all different available sources of data to be stored in AsterixDB, a big data management system,  using Apache Kafka.\n\n- The project became the Final Project for my Bachelor's degree, in which I built a UI visualization to show the spread of Dengue Fever, Zika, Yellow Fever and Chikungunya diseases in Brazil. In order to do that I expanded the sources of data crawled to include news websites and then I built a process to clean and geographically classify the data.",
      "url": "https://uci.edu/",
      "image": "https://www.aefis.com/wp-content/uploads/2012/07/UCI_Logo_for_white_background.png",
      "color": "#0064a4",
      "text": "#fff"
    },
    {
      "period": {
        "beginDate": "June 2016",
        "endDate": "September 2016"
      },
      "jobTitle": "Developer Intern",
      "company": "ADD Labs",
      "location": "Niterói, Brazil",
      "description": "ADDSMS project: store and analyze a large amount of data on occupational accidents in Petrobras (most important Brazilian energy corporation).\n\nPerformed several tests.",
      "url": "http://www.addlabs.uff.br/",
      "image": "http://www.addlabs.uff.br/2017/wp-content/themes/sydney/images/logo-colorido.png",
      "color": "#f5f9fb",
      "text": "#000"
    }
  ],
  "theme": {
    "color": "#F6F0FD",
    "fontUrl": "https://fonts.googleapis.com/css?family=Montserrat",
    "fontName": "'Montserrat', sans-serif",
    "fontColor": "#212B36"
  }
}